<template>
  <div @click="sendwallpost('Мой текст сообщения, который надо отправить на страницу Вконтакте');">отправить</div>
</template>
<script>

// import VK from '??????????'; !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
export default {
  data() {
    return {
      
    };
  },
   created() {
     this.initVK();
   },

   methods: {
     initVK() {
     // ругается на VK в коде ниже !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
       VK.init({        
         apiId: 	7798778 // id созданного мною приложения вконтакте 
       });
     }, 

      sendwallpost(mydata) {
      // ругается на VK в коде ниже !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
         VK.api("wall.post", {
             owner_id: '553591004', // id моего аккаунта вконтакте 
             message: mydata
         }, function (data) {
           console.log(data);
         });
      }
   }
}
</script>
